MI4B/app/Models/GenreModel.php

    public function getOrderBy()
    {
        return $this->OrderBy('created_at', 'desc')->findAll();
---
SELECT *
FROM `genre`