MI4B/app/Controllers/Film.php

INSERT INTO `film` (`nama_film`, `id_genre`, `duration`, `cover`) VALUES ('Argantara2', '7', '2 jam 30 menit', '1687320957_2520ff0e419be6a5982e.jpg')
---
    public function store()
    {
        $image =$this->request->getFile('cover');

        $imageName =$image->getRandomName();

        $image->move(ROOTPATH . 'public/assets/cover/', $imageName);

        $data=[
            'nama_film' => $this->request->getPost('nama_film'),
            'id_genre' => $this->request->getPost('id_genre'),
            'duration' => $this->request->getPost('duration'),
            'cover' =>  $imageName,
        ];
        $this->Film->save($data);